app/views/bets/index.html.erb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", 14]]
---
          <td><%= bet.description %></td>
          <% user = Usuario.find(bet.usuario_id) %>