app/views/bets/new.html.erb

              </span>
              <%= select_tag :usuario_id, options_for_select(Usuario.all.collect{|u| [u.name, u.id]}), include_blank: true, class: "form-control", :required => true %>
---
SELECT "usuarios".* FROM "usuarios"