app/controllers/bets_controller.rb

  def index
    @bets = Bet.all
---
SELECT "bets".* FROM "bets"

  def bet_create
  	@bet = Bet.new(bet_params)
    @bet.usuario_id = session[:user_id]
    @bet.category = 'Personalizado'
    @bet.room_status = 1

    respond_to do |format|
      if @bet.save
---
INSERT INTO "bets" ("name", "description", "url_photo", "room_type", "stake", "usuario_id", "category", "room_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @bet.update(bet_params)
---
UPDATE "bets" SET "description" = $1, "final_answer" = $2, "answer_type" = $3, "final_date" = $4, "updated_at" = $5 WHERE "bets"."id" = $6  [["description", "Qual a escada?"], ["final_answer", ""], ["answer_type", ""], ["final_date", "2016-11-13"], ["updated_at", "2016-11-13 02:34:22.123414"], ["id", 2]]

    def set_bet
      @bet = Bet.find(params[:id])
---
SELECT  "bets".* FROM "bets" WHERE "bets"."id" = $1 LIMIT 1  [["id", 2]]