app/controllers/salas_controller.rb

SELECT "salas".* FROM "salas"
---
  def index
    @salas = Sala.all